# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSet..::..Erase Method
CorrectionFactorSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	CorrectionFactor item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As CorrectionFactor _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	CorrectionFactor^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..CorrectionFactor
# See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace